# ICE02 Analysis_SQL

To make cell into "Code" (executable) cell: click on cell and choose "Code" from upper drop-down box.
   - To execute any cell: click on cell and then hit Ctl-Enter
   - To comment out any LINE in a cell: click or highlight line and hit Ctl-/.  To un-comment, click and hit Ctl-/ again.
   - To comment out any SECTION in a cell: highlight section and hit Ctl-/.  To un-comment, highlight and hit Ctl-/ again.

To make cell into "Markdown" (documentation) cell: click on cell and choose "Markdown" from upper drop-down box.
   - To edit any "Markdown" cell: double-click on cell: this will enable modification
   - To format-for-display any "Markdown" cell being editted: execute cell (using Ctl-Enter).

## 01 How to (pip) Install any needed Python packages
<br>1. Open Anaconda Prompt with option: Run as administrator (if this is not allowed, try Open Anaconda Prompt without admin)
<br>2. Type: pip install package_name and press Enter. For example, to install package graphviz you type: pip install graphviz at command prompt and press Enter

In [2]:
#packages for manipulating data
import pandas as pd
import numpy as np

#package for connecting to SQL Server
import pyodbc

#setting up environment
%matplotlib inline
pd.set_option('display.max_columns',500 )
import warnings
warnings.filterwarnings('ignore')   #turn off warning

# 02a (Optional) Read a csv-file into a dataframe (do either 2a or 2b)

If you have a csv file of data that is preferable to a result-table from a SQL select command, then use the 2a technique here to read the csv into a dataframe: 
otherwise, use the 2b technique later in the notebook to read the SQL-result-table into the dataframe.

In the code below, replace CCID with your UofA CCID.  Replace outdf.csv with the name of your csv file.

In [3]:
df = pd.read_csv(r'C:\users\vdavis\vTargetMail_ICA04a.csv', encoding='utf-8') 
df.head(8)

,CustomerKey,GeographyKey,Title,FirstName,MiddleName,LastName,NameStyle,BirthDate,MaritalStatus,Suffix,Gender,EmailAddress,YearlyIncome,TotalChildren,NumberChildrenAtHome,EnglishEducation,EnglishOccupation,HouseOwnerFlag,NumberCarsOwned,AddressLine1,AddressLine2,Phone,DateFirstPurchase,CommuteDistance,Region,Age,BikeBuyer
0,22576,11,NaN,Tony,L,Xu,0,1980-12-24,S,NaN,M,tony8@adventure-works.com,20000.0,0,0,Bachelors,Clerical,0,0,8489 Barbie Dr.,NaN,1 (11) 500 555-0154,2006-11-02,0-1 Miles,Pacific,36,1
1,22577,13,NaN,Bryant,S,Sai,0,1980-06-02,M,NaN,M,bryant6@adventure-works.com,20000.0,0,0,Bachelors,Clerical,1,0,8500 Byers Rd.,NaN,1 (11) 500 555-0180,2006-11-30,0-1 Miles,Pacific,37,1
2,22578,37,NaN,Juan,P,Vazquez,0,1977-10-12,S,NaN,M,juan3@adventure-works.com,10000.0,0,0,High School,Manual,0,2,2736 Scottsdale Rd,NaN,1 (11) 500 555-0182,2006-11-10,0-1 Miles,Pacific,39,1
3,22579,13,NaN,Kara,NaN,Lal,0,1976-04-17,S,NaN,F,kara9@adventure-works.com,10000.0,1,1,High School,Manual,0,0,7340 Pine Creek Way,NaN,1 (11) 500 555-0174,2006-11-17,1-2 Miles,Pacific,41,1
4,22580,23,NaN,Alexis,NaN,Long,0,1979-04-07,S,NaN,F,alexis32@adventure-works.com,10000.0,1,1,High School,Manual,0,0,3376 Jacaranda Dr.,NaN,1 (11) 500 555-0174,2006-11-03,1-2 Miles,Pacific,38,1
5,22581,19,NaN,Theresa,F,Vazquez,0,1979-08-20,M,NaN,F,theresa10@adventure-works.com,20000.0,0,0,Bachelors,Clerical,0,0,5227 Sutton Circle,NaN,1 (11) 500 555-0116,2006-11-11,0-1 Miles,Pacific,38,1
6,22582,27,NaN,Evelyn,D,Madan,0,1979-11-17,S,NaN,F,evelyn8@adventure-works.com,20000.0,0,0,Bachelors,Clerical,0,0,8162 Zacatecas,NaN,1 (11) 500 555-0137,2006-11-07,0-1 Miles,Pacific,37,1
7,22583,25,NaN,Troy,R,Sara,0,1977-08-12,S,NaN,M,troy11@adventure-works.com,20000.0,0,0,Partial College,Manual,1,0,1002 N. Spoonwood Court,NaN,1 (11) 500 555-0139,2006-11-16,1-2 Miles,Pacific,40,1

# 02b (Optional) Connect to SQL Server and select data (do either 2a or 2b)

Following code lines are used to:
<br>1) Declare a connection spec, including:
        - Server: MyServerURL\MyDBMSInstanceNameNumber
        - database: AdventureworksDW2012
        - user account:
            - UID: MyLogin
            - PWD: MyPassword
2) Declare a query to select all records from vTargetMail tabel: <i>'SELECT * from vTargetMail'</i>
<br>3) Call the function <i>'read_sql'</i> to execute the query and store return result in a dataframe <b><i>df</i></b>
<br>4) Display first 8 rows in the datafame <b><i>df</i></b>

In [5]:
sql_conn = pyodbc.connect('''DRIVER={ODBC Driver 13 for SQL Server};
                        SERVER= MyServerURL\MyDBMSInstanceNameNumber;
                        DATABASE=AdventureworksDW2012;
                        UID=MyLogin;
                        PWD=MyPassword''')
query = 'SELECT * from vTargetMail'
df = pd.read_sql(query, sql_conn)
df.head(8)

# 3 Metadata of a dataframe

Pandas <b><i>dataframe.describe(include = 'all')</i></b> is a function that generates descriptive statistics of data in a dataframe. 
<br>- For numeric data, the result’s index will include count, mean, std, min, max as well as lower, 50 and upper percentiles. By default the lower percentile is 25 and the upper percentile is 75. The 50 percentile is the same as the median.
<br> - For object data (e.g. strings or timestamps), the result’s index will include count, unique, top, and freq. The top is the most common value. The freq is the most common value’s frequency. Timestamps also include the first and last items.

In [10]:
df.describe(include = 'all')

If you only want to see descriptive statistics for NUMERIC columns in the dataframe, remove option <i>include = 'all'</i> when calling the function (as shown below)

In [12]:
df.describe()

# 4. Classic Relational Operators on Tables and Dataframes

## 4.01 Projection (choose columns): in both SQL and Python

SQL code that chooses columns (Projection) is shown below:

In [9]:
sqlQuery = """SELECT CustomerKey, FirstName, MiddleName, LastName, MaritalStatus, YearlyIncome
                FROM vTargetMail"""
Df_SQL_Project = pd.read_sql(sqlQuery, sql_conn)
Df_SQL_Project.head(8)

In Python: Projection is done by an operator that returns a new dataframe by selecting certain columns (all rows) from an old dataframe

In [4]:
wantedColumns = ['CustomerKey','FirstName','MiddleName','LastName','MaritalStatus','YearlyIncome']
Df_ProjectSixColumns = df[wantedColumns]
Df_ProjectSixColumns.head(8)

   CustomerKey FirstName MiddleName LastName MaritalStatus  YearlyIncome
0        22576      Tony          L       Xu             S       20000.0
1        22577    Bryant          S      Sai             M       20000.0
2        22578      Juan          P  Vazquez             S       10000.0
3        22579      Kara        NaN      Lal             S       10000.0
4        22580    Alexis        NaN     Long             S       10000.0
5        22581   Theresa          F  Vazquez             M       20000.0
6        22582    Evelyn          D    Madan             S       20000.0
7        22583      Troy          R     Sara             S       20000.0

## 4.02 Selection (rows) & Projection (columns): in both SQL and Python

SQL code that chooses rows (Selection) and chooses columns (Projection) is shown below:

In [8]:
sqlQuery = """SELECT CustomerKey, FirstName, MiddleName, LastName, MaritalStatus, YearlyIncome
                FROM vTargetMail
                WHERE MaritalStatus = 'M' and YearlyIncome > 20000"""
Df_SQL_ProjectSelect = pd.read_sql(sqlQuery, sql_conn)
Df_SQL_ProjectSelect.head(8)

In Python sample below: Selection is done by an operator that returns a new dataframe by including rows from an old dataframe (2nd line below)

In [5]:
wantedColumns = ['CustomerKey','FirstName','MiddleName','LastName','MaritalStatus','YearlyIncome']
Df_SelectRows_IncMari = df[(df.YearlyIncome>20000) & (df.MaritalStatus == 'M')][wantedColumns]
Df_SelectRows_IncMari.head(8)

    CustomerKey  FirstName MiddleName LastName MaritalStatus  YearlyIncome
10        22586      Derek          T     Shen             M       30000.0
18        22594  Gabriella          S    James             M       30000.0
19        22595    Nicolas          W      Xie             M       40000.0
20        22596       Omar          A       Xu             M       30000.0
21        22597    Rachael          V  Chandra             M       30000.0
23        22599     Philip        NaN     Gill             M       40000.0
25        22601      Aimee        NaN      Gao             M       30000.0
33        22609   Clarence          L      Cai             M       30000.0

## ------------------------------------------------------------------------------------------------

SQL code with Alternative Select by "partial-match" string condition (with Project of seven columns):

In [13]:
sqlQuery = """SELECT CustomerKey, FirstName, MiddleName, LastName, MaritalStatus, YearlyIncome, EnglishEducation
                FROM vTargetMail
                WHERE EnglishEducation like '%i%'"""
Df_SQL_ProjectSelectLetterI = pd.read_sql(sqlQuery, sql_conn)
Df_SQL_ProjectSelectLetterI.head(8)

In Python sample below: Alternative Select by "partial-match" string condition (with Project of seven columns)

In [6]:
wantedColumns = ['CustomerKey','FirstName','MiddleName','LastName','MaritalStatus','YearlyIncome','EnglishEducation']
Df_Python_ProjectSelectLetterI = df[df['EnglishEducation'].str.contains('i') == True][wantedColumns]
Df_Python_ProjectSelectLetterI.head(8)

,CustomerKey,FirstName,MiddleName,LastName,MaritalStatus,YearlyIncome,EnglishEducation
2,22578,Juan,P,Vazquez,S,10000.0,High School
3,22579,Kara,NaN,Lal,S,10000.0,High School
4,22580,Alexis,NaN,Long,S,10000.0,High School
7,22583,Troy,R,Sara,S,20000.0,Partial College
8,22584,Meagan,NaN,Lopez,S,20000.0,Partial College
11,22587,Gina,C,Alonso,S,20000.0,Partial College
12,22588,Teresa,D,Martin,S,20000.0,Partial College
13,22589,Cynthia,NaN,Suri,S,20000.0,Partial College

## 4.03 Order By (& Selection & Projection) in both SQL and in Python

SQL code that sorts rows (ie. Order By) in addition to Selection and Projection is shown below:

In [34]:
sqlQuery = """SELECT CustomerKey, FirstName, MiddleName, LastName, MaritalStatus, YearlyIncome
                FROM vTargetMail
                WHERE MaritalStatus = 'M' and YearlyIncome > 20000
                ORDER BY YearlyIncome, CustomerKey desc"""
Df_SQL_ProjectSelectOrderBy = pd.read_sql(sqlQuery, sql_conn)
Df_SQL_ProjectSelectOrderBy.head(8)

In Python: Ordering (ie Sorting) is done by an operator that modifies (sorts) an existing dataframe according to one or more parameters, each of which could be Ascending or Descending

In [7]:
Df_Python_ProjectOrderBy = df[(df.YearlyIncome>20000) & (df.MaritalStatus == 'M')].sort_values(by = ['YearlyIncome','CustomerKey'], ascending=[True,False])
Df_Python_ProjectSelectOrderBy = Df_Python_ProjectOrderBy[['CustomerKey','FirstName','MiddleName','LastName','MaritalStatus','YearlyIncome']]
Df_Python_ProjectSelectOrderBy.head(8)

,CustomerKey,FirstName,MiddleName,LastName,MaritalStatus,YearlyIncome
18483,29483,Jésus,L,Navarro,M,30000.0
18482,29482,Clayton,NaN,Zhang,M,30000.0
18479,29479,Tommy,L,Tang,M,30000.0
18469,29469,Dominique,M,Saunders,M,30000.0
18468,29468,Jacqueline,H,Morris,M,30000.0
18467,29467,Monica,J,Mehta,M,30000.0
18466,29466,Lance,NaN,Jimenez,M,30000.0
18413,29413,Arthur,T,Garcia,M,30000.0

## 4.04 Union: In both SQL and in Python

Union is a operator that creates a new table (or dataframe) by combining all of the rows in one table (dataframe) with all of the rows in another table (dataframe).  The respectively-positioned columns within each table (dataframe) should be of the same data-type.

Before SQL Union: Give first name, middle name, last name and yearly income of MALE single bike buyers

In [13]:
sqlQuery = """SELECT FirstName,MiddleName,LastName,YearlyIncome
                FROM vTargetMail
                WHERE BikeBuyer = 1 AND MaritalStatus = 'S' AND Gender = 'M'
                Order by LastName"""
Df_SQL_Male = pd.read_sql(sqlQuery, sql_conn)
Df_SQL_Male.head(8)

Before SQL Union: Give first name, middle name, last name and yearly income of FEMALE single bike buyers

In [12]:
sqlQuery = """SELECT FirstName,MiddleName,LastName,YearlyIncome
                FROM vTargetMail
                WHERE BikeBuyer = 1 AND MaritalStatus = 'S' AND Gender = 'F'
                Order by LastName"""
Df_SQL_Female = pd.read_sql(sqlQuery, sql_conn)
Df_SQL_Female.head(8)

SQL Union: Now, Union the above 2 sets into 1 set: Sort by LastName,FirstName to easily show mix of M and F

In [15]:
sqlQuery = """SELECT FirstName,MiddleName,LastName,YearlyIncome
                FROM vTargetMail
                WHERE BikeBuyer = 1 AND MaritalStatus = 'S' AND Gender = 'F'
                UNION
                SELECT FirstName,MiddleName,LastName,YearlyIncome
                FROM vTargetMail
                WHERE BikeBuyer = 1 AND MaritalStatus = 'S' AND Gender = 'M'
                Order by LastName, FirstName"""
Df_SQL_Union = pd.read_sql(sqlQuery, sql_conn)
Df_SQL_Union.head(8)

## ------------------------------------------------------------------------------------------------

Before Python Union: Give first name, middle name, last name and yearly income of MALE single bike buyers

In [8]:
maleSingleBikeBuyers = df[(df.BikeBuyer == 1) & (df.MaritalStatus == 'S') & (df.Gender == 'M')][['FirstName','MiddleName','LastName','YearlyIncome']]
maleSingleBikeBuyers.head(8)

   FirstName MiddleName LastName  YearlyIncome
0       Tony          L       Xu       20000.0
2       Juan          P  Vazquez       10000.0
7       Troy          R     Sara       20000.0
9     Kelvin          A       He       30000.0
15       Jon          G   Becker       30000.0
17    Thomas          C  Johnson       30000.0
22    Donald        NaN  Sanchez       30000.0
24   Maurice          L    Kumar       30000.0

Before Python Union: Give first name, middle name, last name and yearly income of FEMALE single bike buyers

In [9]:
femaleSingleBikeBuyers = df[(df.BikeBuyer == 1) & (df.MaritalStatus == 'S') & (df.Gender == 'F')][['FirstName','MiddleName','LastName','YearlyIncome']]
femaleSingleBikeBuyers.head(8)

   FirstName MiddleName  LastName  YearlyIncome
3       Kara        NaN       Lal       10000.0
4     Alexis        NaN      Long       10000.0
6     Evelyn          D     Madan       20000.0
11      Gina          C    Alonso       20000.0
16   Lindsey          K     Anand       30000.0
26     Kelli        NaN  Andersen       10000.0
27    Autumn        NaN        He       10000.0
31   Whitney          Y  Gonzalez       20000.0

Python Union: Use Concat to give first name, middle name, last name and yearly income of ALL (Male & Female) single bike buyers

In [10]:
singleBikeBuyers = pd.concat([maleSingleBikeBuyers, femaleSingleBikeBuyers]).sort_values(by = ['LastName','FirstName'], ascending=[True,True])
singleBikeBuyers.head(8)

       FirstName MiddleName LastName  YearlyIncome
18170  Alexandra          J    Adams       60000.0
3845     Allison          L    Adams       40000.0
15746      Amber        NaN    Adams       60000.0
7561      Andrea          M    Adams      170000.0
17678        Ben        NaN    Adams       80000.0
11424     Connor        NaN    Adams       90000.0
8791    Courtney          C    Adams       70000.0
3953     Gabriel          S    Adams       50000.0

## 4.05 Group by and Having: In both SQL and in Python

In SQL: Using Group By to produce one aggregation of one column (eg. avg of YearlyIncome)

In [8]:
sqlQuery = """SELECT Gender, avg(YearlyIncome)
                FROM vTargetMail
                GROUP BY Gender"""
Df_SQL_GroupBy = pd.read_sql(sqlQuery, sql_conn)
Df_SQL_GroupBy.head(8)

In Python: Using groupby to produce one aggregation of one column (eg. mean of YearlyIncome)

In [11]:
Df_Python_GroupBy = df[['Gender','YearlyIncome']].groupby('Gender').mean()
Df_Python_GroupBy.head(8)

        YearlyIncome
Gender
F       57369.977006
M       57243.075607

## ------------------------------------------------------------------------------------------------

In SQL: Using Having to filter (using avg(YearlyIncome)) the results of "Group By": (grouped by English occupation, with two different aggregations on one column)

In [12]:
sqlQuery = """SELECT EnglishOccupation, avg(YearlyIncome) as Avg_Inc, sum(YearlyIncome) as Sum_Inc
                FROM vTargetMail
                GROUP BY EnglishOccupation
                HAVING avg(YearlyIncome)>50000
                ORDER BY Sum_Inc desc"""
Df_SQL_GroupBy_Having = pd.read_sql(sqlQuery, sql_conn)
Df_SQL_GroupBy_Having.head(8)

In Python: Filter (using YearlyIncome['mean']>50000) the results of "groupby": (grouped by English occupation, with two different aggregations on one column)

In [14]:
gDf = df.groupby('EnglishOccupation').agg({'YearlyIncome':['mean','sum']})
gDf= gDf[gDf.YearlyIncome['mean']>50000]
# gDf = gDf.reset_index()                                   #do reset_index to make group-by column accessible as a column
# gDf.columns = ["EnglishOccupation", "Avg_Inc", "Sum_Inc"] #rename columns so avg and sum are accesible, simple columns
# gDf = grDf.sort_values(by="Sum_Inc", ascending=False)
gDf.head(8)

                   YearlyIncome
                           mean          sum
EnglishOccupation
Management         92325.203252  283900000.0
Professional       74184.782609  409500000.0
Skilled Manual     51715.097225  236700000.0

## ------------------------------------------------------------------------------------------------

In SQL: Using Having to filter (using avg(Age)>=51) the results of "Group By": (grouped by English occupation, with three different aggregations across three different columns)

In [58]:
sqlQuery = """SELECT EnglishOccupation, sum(YearlyIncome) as Sum_Inc, avg(Age) as Avg_Age, count(CustomerKey) as Count_Cust
                FROM vTargetMail
                GROUP BY EnglishOccupation
                HAVING avg(Age)>=51
                ORDER BY Sum_Inc desc"""
Df_SQL_GroupBy_Having = pd.read_sql(sqlQuery, sql_conn)
Df_SQL_GroupBy_Having.head(8)

In Python: Filter (using Age>=51) the results of "groupby" aggregation: (grouped by English occupation, with three different aggregations across three different columns)

In [15]:
gDf = df.groupby('EnglishOccupation').agg({'YearlyIncome':np.sum,'Age':np.mean,'CustomerKey':np.size}) #multiple aggregations of multiple columns
gDf= gDf[gDf.Age>=51]
grDf = gDf.reset_index()                                                      #do reset_index to make group-by column accessible as a column
# grDf.columns = ["EnglishOccupation", "Sum_Inc", "Avg_Age","Count_Cust"]     #rename columns so avg and sum are accesible, simple columns
grDf = grDf.sort_values(by="YearlyIncome", ascending=False)
# grDf = grDf.sort_values(by="Sum_Inc", ascending=False)
grDf.head(8)

  EnglishOccupation  YearlyIncome        Age  CustomerKey
2      Professional   409500000.0  55.819384         5520
1        Management   283900000.0  63.898862         3075
3    Skilled Manual   236700000.0  51.481538         4577
0          Clerical    89920000.0  54.446380         2928

## 4.06 Join: In both SQL and in Python

In SQL: Join two tables, keeping only rows where PK=FK (key names need not match). Order-By for readability (not required)

In [90]:
# Two alternative formats for SQL join are shown below ... 
# sqlQuery = """
#     SELECT TM.CustomerKey, Tm.FirstName, Tm.MiddleName, Tm.LastName, Tm.AddressLine1, 
#            Dg.City, Dg.StateProvinceName, Dg.PostalCode
#     FROM DimGeography Dg, vTargetMail Tm
#     WHERE Dg.GeographyKey = Tm.GeographyKey
#     ORDER BY TM.CustomerKey desc
#     """
sqlQuery = """
    SELECT TM.CustomerKey, Tm.FirstName, Tm.MiddleName, Tm.LastName, Tm.AddressLine1, 
           Dg.City, Dg.StateProvinceName, Dg.PostalCode
    FROM DimGeography Dg JOIN vTargetMail Tm
       ON Dg.GeographyKey = Tm.GeographyKey
    ORDER BY TM.CustomerKey desc
    """
JoinedDf = pd.read_sql(sqlQuery, sql_conn)
JoinedDf.head(8)

In Python: Use "Merge" operation to join two Dataframes on "shared" (must be identically named) columns

First, (use SQL to) Create a separate dataframe from the "other" table (merge of GeoDf to df will be done later...)

In [87]:
sqlQuery = """select * from DimGeography"""
GeoDf =  pd.read_sql(sqlQuery, sql_conn)
GeoDf.head(8)

Then, use "merge" to "join" df to GeoDf on GeographyKey (ie,df.FK=GeoDf.PK). Sort for readability (not required)

In [18]:
MergedJoinedDf = pd.merge(df, GeoDf, on='GeographyKey')
MergedJoinedDf = MergedJoinedDf[['CustomerKey','FirstName','MiddleName','LastName','AddressLine1','City','StateProvinceName','PostalCode']]
MergedJoinedDf = MergedJoinedDf.sort_values(by="CustomerKey", ascending=False)
MergedJoinedDf.head(8)